package Ozon.Contest;

/*
A. Заполни форму (5 баллов)
ограничение по времени на тест1 секунда
ограничение по памяти на тест512 мегабайт
ввод стандартный ввод
вывод стандартный вывод
Это необычная задача. Её цель — проинформировать вас о необходимости заполнить форму.

Прежде чем вы приступите к решению задач, мы хотим вам напомнить о необходимости заполнить форму по ссылке https://forms.office.com/r/2RahksKqQJ. Форма закроется 12 сентября в 10:00 (московское время). Пожалуйста, не забудьте заполнить эту форму.

Если вы уверены, что справитесь с заполнением формы в срок, то у вас есть возможность получить дополнительные 5 баллов!

В качестве решения этой задачи отошлите программу, которая выводит в стандартный вывод (консоль) фразу «I am sure that I will fill out the form by 10:00 am on September 12, 2022.».

Входные данные
В этой задаче нет входных данных. Ваша программа не должна что-либо считывать.

Выходные данные
Выведите фразу «I am sure that I will fill out the form by 10:00 am on September 12, 2022.» (без кавычек).

Пример
входные данные

выходные данные
I am sure that I will fill out the form by 10:00 am on September 12, 2022.
*/

public class TaskA {
    public static void main(String[] args) {
        System.out.println("I am sure that I will fill out the form by 10:00 am on September 12, 2022.");
    }
}
